---
kind: property
id: P:Autodesk.Revit.DB.ExtrusionAnalyzer.StartParameter
source: html/7d4e2c44-7021-7d94-de0f-e964447b17bb.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzer.StartParameter Property

The start parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.

## Syntax (C#)
```csharp
public double StartParameter { get; }
```